days = [["Ваш старинный приятель пригласил вас на охоту. Изволите принять приглашение?", ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
     
     , ['У вашего сына день рождения, но у вас деловая встреча. Изволите отменить встречу?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
     
     , ['Президент Когрании пригласил подписать вас документ, в результате которого вы обмениваетесь научными достижениями. Изволите принять приглашение?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] 
     
     , ['Ваш шпион узнал интересные сведения о правительстве. Изволите его выслушать?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
     
     , ['Вам донесли что в городе Ропка готовится теракт. Изволите подавить его?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] # 5
     
     , ['На нашей территории нашли большие залежи медной руды. Изволите построить шахту?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Один из ученных говорит, что он создал формулу “Вечной молодости”. Изволите спонсировать его?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['В соседней стране революция. Изволите помочь соседним властям?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['В соседней стране революция. Изволите усилить вашу охрану?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] 
 
     , ['Рабочие шахты покинули ее, так как в ней были найдены остатки древней цивилизации. Изволите сказать шахтерам работать в обычно режиме?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] # 10
 
     , ['Вашу семью взяли в заложников. Террористы требуют вас покинуть пост. Изволите покинуть пост президента?', ['Да', 'Нет'], [[-10000, -10000, -1000000000000], [0, 0, 0]]]
 
     , ['Вашу семью взяли в заложников. Террористы требуют выкуп и вертолет. Изволите выполнить их требование?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['В одном из ваших городов потоп. МЧС не справляются, выслать отряд помощи?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['На вашу страну напали. Вашим войскам удалось отбить атаку. Перейти в контратаку?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Ваш сотрудник пытался вас отравить. Посадить его в тюрьму?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] # 15
 
     , ['На территории нашей страны сгорел памятник архитектуры. Прикажите реставрировать?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Музей архитектуры требует востановления. Реставрировать?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Министерство образования хочет ввести бесплатное питание в школах. Подписать указ? ', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Министерство образования хочет отменить систему оценивая, с сохранением ОГЭ и ЕГЭ. Подписать указ?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Министерство образования хочет ввести новый обязательный предмет "Философия". Подписать указ? ', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] # 20
 
     , ['Министерство обороны запрашивает у вас 3000000 дублей на новейшую систему ракетных установовок. Заплотить им 3000000 дублей', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] 
 
     , ['А.П.Закров(посол Каброловой страны) предлагает подписать мирное соглашение. При условии военного альянса. Подписать соглашение?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['На нашем воздушном коридоре замечен не заплонированный беспилотный истребитель. Прикажите стрелять на поражение?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Фермеры нашли на своей территории древние остатки больших животных. Археологи хотеть провести раскопки. Дать разрешение на раскопки', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['В Прогоновой стране убили нашего посла, целью которого было подписание мирного соглашения. Объявить войну или послать еще одного посла', ['Объявить войну', 'Послать посла'], [[0, 0, 0], [0, 0, 0]]] # 25
 
     , ['Один человек утверждает, что он доказал квадрат гипотенузы равен сумме квадратов катетов в прямоугольном треугольнике. Наградить его Нобилевской премией', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Ваш содрудник взял взятку, уволить его, вназидание другим?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]] 
 
     , ['Вы владеете контрольным пакетом акций одного завода на котором работает свыше 1500 людей. Бизнесмен хочет купить у вас этот пакет, чтобы построить на месте завода гипермаркет. Продать пакет акций?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
 
     , ['Наши граждане жалуются на отсутствие детских площадок. Построить детские площадки?', ['Да', 'Нет'], [[0, 0, 0], [0, 0, 0]]]
  
     , ['Сын прокурора может сесть в тюрьму. За его освобождение вам хотят дать взятку в размере 50000 дублей. Возьмете ли вы деньги?', ['Да', 'Нет'], [[-1, 2, 500000], [1, -7, 0]]]]

print(days)