from flask import Flask, request
import logging
import json
import random

app = Flask(__name__)

logging.basicConfig(level=logging.INFO)

a = 0
narod = 10
chin = 10
cash = 1000000
day = 1
end = 0
win = 1
task = []

ends = {
    1: '1540737/6e86ea50fa11cb078b1d',
    2: '1540737/16b3ad0d3c8ab4a4a2ba',
    3: '1540737/3f1c0effc5ecb99148c3',
    4: '1540737/b50e97a12c1b4457e91b'
}

days = [
    [
        "Ваш старинный приятель пригласил вас на охоту. Изволите принять приглашение?",
        [
            'Да', 'Нет'
        ],
        [
            [
                1, 2, 50000
            ],
            [
                0, -3, -25000
            ]
        ]
    ]

    , [
        'У вашего сына день рождения, но у вас деловая встреча.' \
        + ' Вы не успеите и туда и туда. Изволите отменить встречу?',
        [
            'Да', 'Нет'
        ],
        [
            [
                0, -2, -10000
            ],
            [
                0, 1, 50000
            ]
        ]
    ]

    , [
        'Президент Нермании пригласил подписать вас документ, в результате' \
        + ' которого вы обмениваетесь научными достижениями. Изволите принять приглашение?',
        [
            'Да', 'Нет'
        ],
        [
            [
                0, 0, 50000
            ],
            [
                0, -2, -20000
            ]
        ]
    ]

    ,
    [
        'Ваш шпион узнал интересные сведения о правительстве. Изволите его выслушать?',
        [
            'Да', 'Нет'
        ],
        [
            [
                2, -4, -10000
            ],
            [
                -2, 2, 0
            ]
        ]
    ]

    , [
        'Вам донесли что в городе Лермь готовится теракт. Изволите усилить патрули?',
        [
            'Да', 'Нет'
        ],
        [
            [
                0, 0, -10000
            ],
            [
                -3, -1, 0
            ]
        ]
    ]  # 5

    , [
        'На территории Белябинска нашли большие залежи медной руды. Изволите построить шахту?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -4, 1, 100000
            ],
            [
                1, 0, 0
            ]
        ]
    ]

    , [
        'Один из ученных говорит, что он создал формулу “Вечной молодости”.' \
        + ' Изволите спонсировать его?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -2, 0, -30000
            ],
            [
                0, 0, 0
            ]
        ]
    ]

    , [
        'В соседней стране революция. Изволите помочь соседним властям?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -3, 2, -50000
            ],
            [
                0, -2, 0
            ]
        ]
    ]

    , [
        'В соседней стране революция. Изволите усилить вашу охрану?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -3, -1, -5000
            ],
            [
                0, 0, 0
            ]
        ]
    ]

    , [
        'Рабочие шахты покинули ее, так она может в любой момент обвалиться.' \
        + ' Изволите сказать шахтерам работать в обычном режиме, или усилите её?',
        [
            'Пусть работают', 'Надо усилить'
        ],
        [
            [
                -5, -1, 75000
            ],
            [
                1, 1, -20000
            ]
        ]
    ]  # 10

    , [
        'Вашу семью взяли в заложников.' \
        + ' Террористы требуют 100000 дублей. Заплатите ли вы, или получите компенсацию?',
        [
            'Заплачу', 'Получу деньги'
        ],
        [
            [
                0, 0, -100000
            ],
            [
                -2, 0, 500000
            ]
        ]
    ]

    , [
        'Вашу семью взяли в заложников. ' \
        + 'Террористы требуют выкуп и вертолет. Изволите выполнить их требование?',
        [
            'Да', 'Нет'
        ],
        [
            [
                3, 2, -200000
            ],
            [
                -3, -2, 50000
            ]
        ]
    ]

    , [
        'В одном из ваших городов потоп. МЧС не справляются, выслать отряд помощи?',
        [
            'Да', 'Нет'
        ],
        [
            [
                2, 1, -30000
            ],
            [
                -3, -1, 30000
            ]
        ]
    ]

    , [
        'На вашу страну напали. Вашим войскам удалось отбить атаку. Перейти в контратаку?',
        [
            'Да', 'Нет'
        ],
        [
            [
                2, 1, -100000
            ],
            [
                -3, -1, 40000
            ]
        ]
    ]

    , ['Ваш сотрудник пытался вас отравить. Посадить его в тюрьму?',
       [
           'Да', 'Нет'
       ],
       [
           [
               3, -4, 0
           ],
           [
               -2, -2, 0
           ]
       ]
       ]  # 15

    , [
        'На территории нашей страны сгорел памятник архитектуры. Прикажете реставрировать?',
        [
            'Да', 'Нет'
        ],
        [
            [
                3, -1, -40000
            ],
            [
                -2, 0, 20000
            ]
        ]
    ]

    , [
        'Музей архитектуры требует востановления. Прикажете реставрировать?',
        [
            'Да', 'Нет'
        ],
        [
            [
                3, 1, -50000
            ],
            [
                -2, 0, 20000
            ]
        ]
    ]

    , [
        'Министерство образования хочет ввести бесплатное питание в школах. Подписать указ? ',
        [
            'Да', 'Нет'
        ],
        [
            [
                3, 2, -50000
            ],
            [
                -2, -1, 0
            ]
        ]
    ]

    , [
        'Министерство образования хочет отменить' \
        + ' систему оценивая, с сохранением ОГЭ и ЕГЭ. Подписать указ?',
        [
            'Да', 'Нет'
        ],
        [
            [
                4, 2, 0
            ],
            [
                0, -2, 0
            ]
        ]
    ]

    , [
        'Министерство образования хочет ввести новый' \
        + ' обязательный предмет "Философия". Подписать указ? ',
        [
            'Да', 'Нет'
        ],
        [
            [
                -1, 2, 0
            ],
            [
                0, -2, 0
            ]
        ]
    ]

    , [
        'Министерство обороны запрашивает у вас 300000' \
        + ' дублей на новейшую систему ракетных установовок. Заплатить им 300000 дублей?',
        [
            'Да', 'Нет'
        ],
        [
            [
                0, 2, -300000
            ],
            [
                0, -4, 35000
            ]
        ]
    ]

    , [
        'А.П.Закров(посол Йеларуси) предлагает ' \
        + 'подписать мирное соглашение, но при условии военного альянса. Подписать соглашение?',
        [
            'Да', 'Нет'
        ],
        [
            [
                0, -1, -30000
            ],
            [
                -1, 0, -15000
            ]
        ]
    ]

    , [
        'На нашем воздушном коридоре замечен не запланиров' \
        + 'анный беспилотный истребитель. Прикажете стрелять на поражение?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -2, 1, 15000
            ],
            [
                -1, -2, 0
            ]
        ]
    ]

    , [
        'Фермеры нашли на своей территории древние остатки больших' \
        + ' животных. Археологи хотеть провести раскопки. Дать разрешение на раскопки',
        [
            'Да', 'Нет'
        ],
        [
            [
                -3, 1, -20000
            ],
            [
                1, -1, 15000
            ]
        ]
    ]

    , [
        'В Хранции убили нашего посла, целью которого' \
        + ' было подписание мирного соглашения. Объявить войну или послать еще одного посла',
        [
            'Объявить войну', 'Послать посла'
        ],
        [
            [
                2, 2, -50000
            ],
            [
                1, -1, -5000
            ]
        ]
    ]  # 25

    , [
        'Один человек утверждает, что он доказал квадрат гипотенузы равен' \
        + ' сумме квадратов катетов в прямоугольном треугольнике. Наградить его Нобилевской премией',
        [
            'Да', 'Нет'
        ],
        [
            [
                -2, -2, -10000
            ],
            [
                1, 1, 10000
            ]
        ]
    ]

    , [
        'Ваш содрудник взял взятку, уволить его без возможности дальшей работы, вназидание другим?',
        [
            'Да', 'Нет'
        ],
        [
            [
                1, -3, 40000
            ],
            [
                -2, 1, 15000
            ]
        ]
    ]

    , [
        'Вы владеете контрольным пакетом акций одного завода на котором работает' \
        + ' свыше 1500 людей. Бизнесмен хочет купить у вас этот пакет,' \
        + ' чтобы построить на месте завода гипермаркет. Продать пакет акций?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -3, 1, 70000
            ],
            [
                1, -2, 0
            ]
        ]
    ]

    , [
        'Наши граждане жалуются на отсутствие детских площадок. Построить детские площадки?',
        [
            'Построить', 'Не строить'
        ],
        [
            [
                3, 0, -25000
            ],
            [
                -2, 0, 0
            ]
        ]
    ]

    , [
        'Вы нашли миллион! Возьмете ли вы его себе, или разделите с первыми лицами государства?',
        [
            'Возьму', 'Разделю'
        ],
        [
            [
                0, -10, 1000000
            ],
            [
                0, 3, 250000
            ]
        ]
    ]

    , [
        'Сын прокурора может сесть в тюрьму. За его освобождение вам хотят ' \
        + 'дать взятку в размере 50000 дублей. Возьмете ли вы деньги?',
        [
            'Да', 'Нет'
        ],
        [
            [
                -1, 2, 50000
            ],
            [
                1, -2, 0
            ]
        ]
    ]
]

sessionStorage = {}


@app.route('/post', methods=['POST'])
def main():
    logging.info('Request: %r', request.json)
    response = {
        'session': request.json['session'],
        'version': request.json['version'],
        'response': {
            'end_session': False
        }
    }
    handle_dialog(response, request.json)
    logging.info('Response: %r', response)
    return json.dumps(response)


name_of_user = ''
def handle_dialog(res, req):
    global a, end, narod, chin, cash, day, win, task, name_of_user
    user_id = req['session']['user_id']

    if req['session']['new']:
        a = 0
        narod = 10
        chin = 10
        cash = 1000000
        day = 1
        end = 0
        sessionStorage[user_id] = {
            'first_name': None
        }
        win = 1
        task = []
        res['response']['text'] = 'Привет! Назови свое имя!'
        return

    if sessionStorage[user_id]['first_name'] is None:
        first_name = get_first_name(req)
        if first_name is None:
            res['response']['text'] = \
                'Не расслышала имя. Повтори, пожалуйста!'
        else:
            sessionStorage[user_id]['first_name'] = first_name
            name_of_user = first_name.title()
            res['response'][
                'text'] = 'Приятно познакомиться, ' + first_name.title() \
                          + '. Я - Алиса. Давай сыграем в игру!'
            res['response']['buttons'] = [
                {
                    'title': 'Давай',
                    'hide': True
                }
            ]
    else:
        if a == 0:
            if req['request']['command'] == 'Давай':
                res['response'][
                    'text'] = 'Вы - президент Фоссии, которую уже давно '\
                    +'терроризируют продажные чиновники. Настал последний месяц'\
                    +' вашего последнего срока на посту, и вы очень хотите бежать'\
                    +' из страны. Ваша задача - заработать 1000000 дублей на'\
                    +' билеты из Фоссии(один миллион вы уже накопили).'\
                    +' Для этого вы 30 дней принимаете по решению, которое влияет'\
                    +' на один из 2 параметров: отношение народа и отношение'\
                    +' чиновников. Однако вас посадят в тюрьму если один из'\
                    +' параметров превысит 20 или упадет ниже 0. ' \
                    + name_of_user + ', вы готовы?'
                res['response']['buttons'] = [
                    {
                        'title': 'Да',
                        'hide': True
                    }
                ]
                a = 1
            else:
                res['response']['text'] = 'Так я не поняла, сыграем или нет? (попробуй потыкать на кнопки)'
                res['response']['buttons'] = [
                    {
                        'title': 'Давай',
                        'hide': True
                    }
                ]
        else:
            if a == 1:
                if req['request']['command'] != 'Да':
                    res['response']['text'] = 'Так я не поняла, вы готовы или нет? (попробуй потыкать на кнопки)'
                    res['response']['buttons'] = [
                        {
                            'title': 'Да',
                            'hide': True
                        }
                    ]
                else:
                    a = 2
                    task = random.choice(days)
                    end = 1
                    res['response']['text'] = 'День {}: '.format(day) + task[
                        0] + ' (Ваши показатели сейчас: {}, {}, {})'.format(narod, chin, cash)
                    res['response']['buttons'] = [
                        {
                            'title': qqq,
                            'hide': True
                        } for qqq in task[1]
                    ]
            else:
                if narod < 0 or chin < 0 or narod > 20 or chin > 20 or cash < 0:
                    win = 0
                if win:
                    if day <= 30:
                        if not end:
                            if req['request']['command'] != 'Готов':
                                res['response']['text'] = 'Чувствую себя пиратом из спанч'\
                                    + ' боба - не слышу твою речь (попробуй потыкать на кнопки)'
                                res['response']['buttons'] = [
                                    {
                                    'title': 'Готов',
                                    'hide': True
                                }
                            ]
                            else:
                                task = random.choice(days)
                                end = 1
                                res['response']['text'] = 'День {}: '.format(day) + task[
                                    0] + ' (Ваши показатели сейчас: {}, {}, {})'.format(narod, chin, cash)
                                res['response']['buttons'] = [
                                    {
                                        'title': qqq,
                                        'hide': True
                                    } for qqq in task[1]
                                ]
                        else:
                            if req['request']['command'] == task[1][0]:
                                end = 0
                                day += 1
                                sp = task[2][0]
                                narod += sp[0]
                                chin += sp[1]
                                cash += sp[2]
                                res['response'][
                                    'text'] = 'Теперь ваши показатели такие: отношение народа: ' \
                                              + str(narod) + ', отношение чиновников: ' \
                                              + str(chin) + ', деньги: ' + str(cash) + '.' \
                                              + ' Вы готовы начать новый день?'
                                res['response']['buttons'] = [
                                    {
                                        'title': 'Готов',
                                        'hide': True
                                    }
                                ]
                            elif req['request']['command'] == task[1][1]:
                                end = 0
                                day += 1
                                sp = task[2][1]
                                narod += sp[0]
                                chin += sp[1]
                                cash += sp[2]
                                res['response'][
                                    'text'] = 'Теперь ваши показатели такие: отношение народа: ' \
                                              + str(narod) + ', отношение чиновников: ' \
                                              + str(chin) + ', деньги: ' + str(cash) + '.' \
                                              + ' Вы готовы начать новый день?'
                                res['response']['buttons'] = [
                                    {
                                        'title': 'Готов',
                                        'hide': True
                                    }
                                ]
                            else:
                                res['response'][
                                    'text'] = 'Я не поняла ваш ответ, ' \
                                    + name_of_user + ' (попробуй потыкать на кнопки)'
                                res['response']['buttons'] = [
                                    {
                                        'title': qqq,
                                        'hide': True
                                    } for qqq in task[1]
                                ]
                    else:
                        if cash >= 2000000:
                            res['response']['card'] = {}
                            res['response']['card']['type'] = 'BigImage'
                            res['response']['card']['image_id'] = ends[3]
                            res['response']['card'][
                                'title'] = 'Вы выиграли, и смогли бежать в '\
                                +'Геликобританию, чтобы начать там новую'\
                                +' жизнь. Игра окончена успешно, ' + name_of_user
                            res['response']['text'] = 'Игра окончена, ' + name_of_user
                            res['response']['end_session'] = True
                        else:
                            res['response']['card'] = {}
                            res['response']['card']['type'] = 'BigImage'
                            res['response']['card']['image_id'] = ends[2]
                            res['response']['card'][
                                'title'] = 'К сожалению, вы не смогли накопить денег,' \
                                           + ' и вы будете жить в разрушенной вами'\
                                           +' же Фоссии до конца своих дней. Игра'\
                                           +' окончена неуспешно, ' + name_of_user
                            res['response']['text'] = 'Игра окончена, ' + name_of_user
                            res['response']['end_session'] = True
                else:
                    if cash < 0:
                        res['response']['card'] = {}
                        res['response']['card']['type'] = 'BigImage'
                        res['response']['card']['image_id'] = ends[4]
                        res['response']['card'][
                            'title'] = 'Вы обанкротились и вас выгнали с поста'\
                            +'президента. Игра окончена неуспешно, ' + name_of_user
                        res['response']['text'] = 'Игра окончена, ' + name_of_user
                        res['response']['end_session'] = True
                    else:
                        res['response']['card'] = {}
                        res['response']['card']['type'] = 'BigImage'
                        res['response']['card']['image_id'] = ends[1]
                        res['response']['card'][
                            'title'] = 'В стране произошли массовые беспорядки, и '\
                            +'вас осудили на 30 лет за коррупционые схемы. Игра окончена, '\
                            + name_of_user
                        res['response']['text'] = 'Игра окончена, ' + name_of_user
                        res['response']['end_session'] = True

def get_first_name(req):
    for entity in req['request']['nlu']['entities']:
        if entity['type'] == 'YANDEX.FIO':
            return entity['value'].get('first_name', None)


if __name__ == '__main__':
    app.run()
